yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l151r8.h
#define USART3_BRR2_USART_DIV0   USART3_BRR2_bit.USART_DIV0
#define USART3_BRR2_USART_DIV1   USART3_BRR2_bit.USART_DIV1
#define USART3_BRR2_USART_DIV2   USART3_BRR2_bit.USART_DIV2
#define USART3_BRR2_USART_DIV3   USART3_BRR2_bit.USART_DIV3
#define USART3_BRR2_USART_DIV12  USART3_BRR2_bit.USART_DIV12
#define USART3_BRR2_USART_DIV13  USART3_BRR2_bit.USART_DIV13
#define USART3_BRR2_USART_DIV14  USART3_BRR2_bit.USART_DIV14
#define USART3_BRR2_USART_DIV15  USART3_BRR2_bit.USART_DIV15

#define USART3_CR1_PIEN          USART3_CR1_bit.PIEN
#define USART3_CR1_PS            USART3_CR1_bit.PS
#define USART3_CR1_PCEN          USART3_CR1_bit.PCEN
#define USART3_CR1_WAKE          USART3_CR1_bit.WAKE
#define USART3_CR1_M             USART3_CR1_bit.M
#define USART3_CR1_USARTD        USART3_CR1_bit.USARTD
#define USART3_CR1_T8            USART3_CR1_bit.T8
#define USART3_CR1_R8            USART3_CR1_bit.R8

#define USART3_CR2_SBK           USART3_CR2_bit.SBK
#define USART3_CR2_RWU           USART3_CR2_bit.RWU
#define USART3_CR2_REN           USART3_CR2_bit.REN
#define USART3_CR2_TEN           USART3_CR2_bit.TEN
#define USART3_CR2_ILIEN         USART3_CR2_bit.ILIEN
#define USART3_CR2_RIEN          USART3_CR2_bit.RIEN
#define USART3_CR2_TCIEN         USART3_CR2_bit.TCIEN
#define USART3_CR2_TIEN          USART3_CR2_bit.TIEN

#define USART3_CR3_LBCL          USART3_CR3_bit.LBCL
#define USART3_CR3_CPHA          USART3_CR3_bit.CPHA
#define USART3_CR3_CPOL          USART3_CR3_bit.CPOL
#define USART3_CR3_CLKEN         USART3_CR3_bit.CLKEN
#define USART3_CR3_STOP          USART3_CR3_bit.STOP

#define USART3_CR4_ADD           USART3_CR4_bit.ADD

#define USART3_CR5_EIE           USART3_CR5_bit.EIE
#define USART3_CR5_IREN          USART3_CR5_bit.IREN
#define USART3_CR5_IRLP          USART3_CR5_bit.IRLP
#define USART3_CR5_HDSEL         USART3_CR5_bit.HDSEL
#define USART3_CR5_NACK          USART3_CR5_bit.NACK
#define USART3_CR5_SCEN          USART3_CR5_bit.SCEN
#define USART3_CR5_DMAR          USART3_CR5_bit.DMAR
#define USART3_CR5_DMAT          USART3_CR5_bit.DMAT

#endif

/*-------------------------------------------------------------------------
 *      USART3 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_USART3_SR_PE        0x01
#define MASK_USART3_SR_FE        0x02
#define MASK_USART3_SR_NF        0x04
#define MASK_USART3_SR_OR        0x08
#define MASK_USART3_SR_IDLE      0x10
#define MASK_USART3_SR_RXNE      0x20
#define MASK_USART3_SR_TC        0x40
#define MASK_USART3_SR_TXE       0x80

#define MASK_USART3_BRR1_USART_DIV4 0x01
#define MASK_USART3_BRR1_USART_DIV5 0x02
#define MASK_USART3_BRR1_USART_DIV6 0x04
#define MASK_USART3_BRR1_USART_DIV7 0x08
#define MASK_USART3_BRR1_USART_DIV8 0x10
#define MASK_USART3_BRR1_USART_DIV9 0x20
#define MASK_USART3_BRR1_USART_DIV10 0x40
#define MASK_USART3_BRR1_USART_DIV11 0x80

#define MASK_USART3_BRR2_USART_DIV0 0x01
#define MASK_USART3_BRR2_USART_DIV1 0x02
#define MASK_USART3_BRR2_USART_DIV2 0x04
#define MASK_USART3_BRR2_USART_DIV3 0x08
#define MASK_USART3_BRR2_USART_DIV12 0x10
#define MASK_USART3_BRR2_USART_DIV13 0x20
#define MASK_USART3_BRR2_USART_DIV14 0x40
#define MASK_USART3_BRR2_USART_DIV15 0x80

#define MASK_USART3_CR1_PIEN     0x01
#define MASK_USART3_CR1_PS       0x02
#define MASK_USART3_CR1_PCEN     0x04
#define MASK_USART3_CR1_WAKE     0x08
#define MASK_USART3_CR1_M        0x10
#define MASK_USART3_CR1_USARTD   0x20
#define MASK_USART3_CR1_T8       0x40
#define MASK_USART3_CR1_R8       0x80

#define MASK_USART3_CR2_SBK      0x01
#define MASK_USART3_CR2_RWU      0x02
#define MASK_USART3_CR2_REN      0x04
#define MASK_USART3_CR2_TEN      0x08
#define MASK_USART3_CR2_ILIEN    0x10
#define MASK_USART3_CR2_RIEN     0x20
#define MASK_USART3_CR2_TCIEN    0x40
#define MASK_USART3_CR2_TIEN     0x80

#define MASK_USART3_CR3_LBCL     0x01
#define MASK_USART3_CR3_CPHA     0x02
#define MASK_USART3_CR3_CPOL     0x04
#define MASK_USART3_CR3_CLKEN    0x08
#define MASK_USART3_CR3_STOP     0x30

#define MASK_USART3_CR4_ADD      0x0F

#define MASK_USART3_CR5_EIE      0x01
#define MASK_USART3_CR5_IREN     0x02
#define MASK_USART3_CR5_IRLP     0x04
#define MASK_USART3_CR5_HDSEL    0x08
#define MASK_USART3_CR5_NACK     0x10
#define MASK_USART3_CR5_SCEN     0x20
#define MASK_USART3_CR5_DMAR     0x40
#define MASK_USART3_CR5_DMAT     0x80


/*-------------------------------------------------------------------------
 *      RI register definitions
 *-----------------------------------------------------------------------*/
/* Timer input capture routing register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IC2CS       : 5;
} __BITS_RI_ICR1;
#endif
__IO_REG8_BIT(RI_ICR1,     0x5431, __READ_WRITE, __BITS_RI_ICR1);

/* Timer input capture routing register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IC3CS       : 5;
} __BITS_RI_ICR2;
#endif
__IO_REG8_BIT(RI_ICR2,     0x5432, __READ_WRITE, __BITS_RI_ICR2);

/* I/O input register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH1I        : 1;
  unsigned char CH4I        : 1;
  unsigned char CH7I        : 1;
  unsigned char CH10I       : 1;
  unsigned char CH13I       : 1;
  unsigned char CH16I       : 1;
  unsigned char CH19I       : 1;
  unsigned char CH22I       : 1;
} __BITS_RI_IOIR1;
#endif
__IO_REG8_BIT(RI_IOIR1,    0x5433, __READ, __BITS_RI_IOIR1);

/* I/O input register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH2I        : 1;
  unsigned char CH5I        : 1;
  unsigned char CH8I        : 1;
  unsigned char CH11I       : 1;
  unsigned char CH14I       : 1;
  unsigned char CH17I       : 1;
  unsigned char CH20I       : 1;
  unsigned char CH23I       : 1;
} __BITS_RI_IOIR2;
#endif
__IO_REG8_BIT(RI_IOIR2,    0x5434, __READ, __BITS_RI_IOIR2);

/* I/O input register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH3I        : 1;
  unsigned char CH6I        : 1;
  unsigned char CH9I        : 1;
  unsigned char CH12I       : 1;
  unsigned char CH15I       : 1;
  unsigned char CH18I       : 1;
  unsigned char CH21I       : 1;
  unsigned char CH24I       : 1;
} __BITS_RI_IOIR3;
#endif
__IO_REG8_BIT(RI_IOIR3,    0x5435, __READ, __BITS_RI_IOIR3);

